src/extension/InformationRegisters/mcp_ТокеныДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>mcp_ТокеныДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХешТокена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/extension/CommonModules/mcp_ДоступПользователей/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выпускает токен для одного вопроса текущего пользователя. Оркестратор передает его в заголовке
// X-MCP-Token при каждом вызове инструмента, и HTTP-сервис проверяет права этого пользователя.
// В базе хранится только хеш токена.
//
// Параметры:
//  ИдентификаторЗапроса - Строка - идентификатор вопроса в журнале оркестратора
//
// Возвращаемое значение:
//  Строка - токен; передается оркестратору и больше нигде не сохраняется
//
Функция ВыпуститьТокенЗапроса(ИдентификаторЗапроса) Экспорт

	Если Не ПравоДоступа("Использование", Метаданные.Обработки.АнализКонфигурацииMCP) Тогда
		ВызватьИсключение "Нет права задавать вопросы LLM: нужна роль ""Вопросы к LLM по данным базы (MCP)""";
	КонецЕсли;

	СекундВМинуте = 60;
	СрокДействия = ТекущаяДатаСеанса() + mcp_НастройкиLLM.НастройкиБазы().СрокДействияТокенаЗапроса * СекундВМинуте;
	Возврат НовыйТокен(Пользователи.АвторизованныйПользователь(), ВидТокенаЗапроса(), СрокДействия, ИдентификаторЗапроса);

КонецФункции

// Отзывает токен вопроса после ответа. Отозвать можно только свой токен.
//
// Параметры:
//  Токен - Строка - токен, выпущенный ВыпуститьТокенЗапроса
//
Процедура ОтозватьТокенЗапроса(Токен) Экспорт

	Если Не ЗначениеЗаполнено(Токен) Тогда
		Возврат;
	КонецЕсли;

	Хеш = ХешТокена(Токен);
	Сведения = СведенияТокена(Хеш);
	Если Сведения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Сведения.Пользователь <> mcp_НастройкиLLM.ИдентификаторТекущегоПользователя() Тогда
		ВызватьИсключение "Отозвать можно только свой токен";
	КонецЕсли;

	УдалитьТокен(Хеш);

КонецПроцедуры

// Отзывает токены вопроса текущего пользователя по идентификатору запроса. Нужна, когда сам токен
// уже не хранится: он передан оркестратору при отправке вопроса.
//
// Параметры:
//  ИдентификаторЗапроса - Строка - идентификатор, переданный в ВыпуститьТокенЗапроса
//
Процедура ОтозватьТокеныЗапроса(ИдентификаторЗапроса) Экспорт

	Если Не ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Токены.ХешТокена КАК ХешТокена
	|ИЗ
	|	РегистрСведений.mcp_ТокеныДоступа КАК Токены
	|ГДЕ
	|	Токены.Пользователь = &Пользователь
	|	И Токены.Вид = &Вид
	|	И Токены.Описание = &Описание";
	Запрос.УстановитьПараметр("Пользователь", mcp_НастройкиLLM.ИдентификаторТекущегоПользователя());
	Запрос.УстановитьПараметр("Вид", ВидТокенаЗапроса());
	Запрос.УстановитьПараметр("Описание", Лев(ИдентификаторЗапроса, ДлинаОписанияТокена()));

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Пока Выборка.Следующий() Цикл
		УдалитьТокен(Выборка.ХешТокена);
	КонецЦикла;

КонецПроцедуры

// Выпускает персональный токен для внешнего MCP-клиента (Cursor, Claude Desktop). Доступно только
// пользователю с полными правами. Токен показывается один раз: в базе хранится только хеш.
//
// Параметры:
//  Пользователь  - СправочникСсылка.Пользователи - чьи права проверяются при вызовах с этим токеном
//  СрокДействия  - Дата - до какого момента токен действует
//  Описание      - Строка - для чего выпущен токен
//
// Возвращаемое значение:
//  Строка - токен
//
Функция ВыпуститьПерсональныйТокен(Пользователь, СрокДействия, Описание) Экспорт

	ПроверитьПравоАдминистрирования();
	Если СрокДействия <= ТекущаяДатаСеанса() Тогда
		ВызватьИсключение "Срок действия токена должен быть в будущем";
	КонецЕсли;

	Токен = НовыйТокен(Пользователь, ВидТокенаПерсональный(), СрокДействия, Описание);
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , Пользователь,
		"Выпущен персональный токен MCP: " + Описание);

	Возврат Токен;

КонецФункции

// Персональные токены без самих токенов: для списка в настройках. Доступно только пользователю
// с полными правами. Просроченные токены удаляются.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Хеш             - Строка - хеш токена, по нему токен отзывается
//   * ИмяПользователя - Строка - представление пользователя
//   * СрокДействия    - Дата
//   * Создан          - Дата
//   * Описание        - Строка
//
Функция ПерсональныеТокены() Экспорт

	ПроверитьПравоАдминистрирования();
	УдалитьПросроченныеТокены();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Токены.ХешТокена КАК Хеш,
	|	Токены.ИмяПользователя КАК ИмяПользователя,
	|	Токены.СрокДействия КАК СрокДействия,
	|	Токены.Создан КАК Создан,
	|	Токены.Описание КАК Описание
	|ИЗ
	|	РегистрСведений.mcp_ТокеныДоступа КАК Токены
	|ГДЕ
	|	Токены.Вид = &Вид
	|
	|УПОРЯДОЧИТЬ ПО
	|	Создан УБЫВ";
	Запрос.УстановитьПараметр("Вид", ВидТокенаПерсональный());

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Результат = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сведения = Новый Структура("Хеш, ИмяПользователя, СрокДействия, Создан, Описание");
		ЗаполнитьЗначенияСвойств(Сведения, Выборка);
		Результат.Добавить(Сведения);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Отзывает персональный токен по хешу. Доступно только пользователю с полными правами.
//
// Параметры:
//  Хеш - Строка - хеш токена из ПерсональныеТокены
//
Процедура ОтозватьТокенПоХешу(Хеш) Экспорт

	ПроверитьПравоАдминистрирования();
	УдалитьТокен(Хеш);
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		"Отозван персональный токен MCP");

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Контекст доступа вызова инструмента по заголовкам HTTP-запроса: чей токен и действует ли он.
// Вызывается HTTP-сервисом mcp_APIBackend перед tools/call.
//
// Параметры:
//  Заголовки - Соответствие - заголовки HTTP-запроса
//
// Возвращаемое значение:
//  Структура:
//   * ЕстьТокен                   - Булево - в запросе передан токен
//   * Ошибка                      - Строка - причина отказа; пустая строка, если вызов разрешен
//   * ИдентификаторПользователяИБ - Строка - UUID пользователя ИБ из токена
//   * ИмяПользователя             - Строка - представление пользователя из токена
//
Функция КонтекстДоступа(Заголовки) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ЕстьТокен",                   Ложь);
	Результат.Вставить("Ошибка",                      "");
	Результат.Вставить("ИдентификаторПользователяИБ", "");
	Результат.Вставить("ИмяПользователя",             "");

	Токен = ЗначениеЗаголовка(Заголовки, ИмяЗаголовкаТокена());
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Если Не mcp_НастройкиLLM.НастройкиБазы().ДоступКИнструментамБезТокена Тогда
			Результат.Ошибка = "вызов инструментов без токена пользователя запрещен администратором";
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;

	Результат.ЕстьТокен = Истина;
	Хеш = ХешТокена(Токен);
	Сведения = СведенияТокена(Хеш);
	Если Сведения = Неопределено Тогда
		Результат.Ошибка = "токен не найден или отозван";
		Возврат Результат;
	КонецЕсли;
	Если Сведения.СрокДействия < ТекущаяДатаСеанса() Тогда
		УдалитьТокен(Хеш);
		Результат.Ошибка = "срок действия токена истек";
		Возврат Результат;
	КонецЕсли;

	ПользовательИБ = ПользовательИБПоИдентификаторуПользователя(Сведения.Пользователь);
	Если ПользовательИБ = Неопределено Тогда
		Результат.Ошибка = "пользователь токена не найден, недействителен или не может входить в программу";
		Возврат Результат;
	КонецЕсли;
	Если Не ЕстьПраво("Использование", Метаданные.Обработки.АнализКонфигурацииMCP, ПользовательИБ) Тогда
		Результат.Ошибка = "у пользователя токена нет права задавать вопросы LLM";
		Возврат Результат;
	КонецЕсли;

	Результат.ИдентификаторПользователяИБ = Строка(ПользовательИБ.УникальныйИдентификатор);
	Результат.ИмяПользователя             = Сведения.ИмяПользователя;

	Возврат Результат;

КонецФункции

// Ключ, под которым HTTP-сервис передает контекст доступа в аргументах инструмента. Значение,
// присланное клиентом под этим ключом, HTTP-сервис заменяет своим.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяКлючаКонтекста() Экспорт

	Возврат "mcpКонтекстДоступа";

КонецФункции

// Истина, если пользователь, задавший вопрос, может видеть объект метаданных: для отчетов и
// обработок нужно право "Использование", для остальных объектов - "Чтение". Вызов без токена
// (разрешенный администратором) ограничивается правами технического пользователя публикации.
//
// Параметры:
//  Аргументы        - Структура - аргументы инструмента с контекстом доступа
//  ОбъектМетаданных - ОбъектМетаданных - проверяемый объект
//
// Возвращаемое значение:
//  Булево
//
Функция ДоступноПользователю(Аргументы, ОбъектМетаданных) Экспорт

	Контекст = Неопределено;
	Если Не Аргументы.Свойство(ИмяКлючаКонтекста(), Контекст)
		Или ТипЗнч(Контекст) <> Тип("Структура") Или Не Контекст.ЕстьТокен Тогда
		Возврат Истина;
	КонецЕсли;

	ПользовательИБ = Неопределено;
	Если Не Контекст.Свойство("ПользовательИБ", ПользовательИБ) Тогда
		ПользовательИБ = НайтиПользователяИБ(Контекст.ИдентификаторПользователяИБ);
		Контекст.Вставить("ПользовательИБ", ПользовательИБ);
	КонецЕсли;
	Если ПользовательИБ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ВидОбъекта = СтрРазделить(ОбъектМетаданных.ПолноеИмя(), ".")[0];
	Если ВидОбъекта = "Отчет" Или ВидОбъекта = "Обработка" Тогда
		Право = "Использование";
	Иначе
		Право = "Чтение";
	КонецЕсли;

	Возврат ЕстьПраво(Право, ОбъектМетаданных, ПользовательИБ);

КонецФункции

// Вызывает исключение, если у пользователя, задавшего вопрос, нет прав на объект метаданных.
//
// Параметры:
//  Аргументы        - Структура - аргументы инструмента с контекстом доступа
//  ОбъектМетаданных - ОбъектМетаданных - проверяемый объект
//
Процедура ПроверитьДоступПользователя(Аргументы, ОбъектМетаданных) Экспорт

	Если Не ДоступноПользователю(Аргументы, ОбъектМетаданных) Тогда
		ВызватьИсключение СтрШаблон("У пользователя нет прав на %1, данные этого объекта ему недоступны",
			ОбъектМетаданных.ПолноеИмя());
	КонецЕсли;

КонецПроцедуры

// Истина, если инструмент вызван по токену пользователя. Сеанс HTTP-сервиса работает под техническим
// пользователем публикации с минимальными правами, поэтому инструменты, которые отдают данные, читают их
// в привилегированном режиме, но только по токену и только после проверки прав его пользователя через
// ДоступноПользователю. Без токена действуют права технического пользователя.
//
// Параметры:
//  Аргументы - Структура - аргументы инструмента с контекстом доступа
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьТокенПользователя(Аргументы) Экспорт
	
	Контекст = Неопределено;
	Возврат Аргументы.Свойство(ИмяКлючаКонтекста(), Контекст)
		И ТипЗнч(Контекст) = Тип("Структура") И Контекст.ЕстьТокен;
	
КонецФункции

// Записывает в журнал регистрации вызов инструмента: кто спросил и какой инструмент выполнен.
//
// Параметры:
//  ИмяИнструмента - Строка - имя инструмента MCP
//  Контекст       - Структура - см. КонтекстДоступа
//
Процедура ЗаписатьВызовИнструмента(ИмяИнструмента, Контекст) Экспорт

	Если Контекст.ЕстьТокен Тогда
		Комментарий = СтрШаблон("Инструмент %1, пользователь %2", ИмяИнструмента, Контекст.ИмяПользователя);
	Иначе
		Комментарий = СтрШаблон("Инструмент %1 без токена пользователя", ИмяИнструмента);
	КонецЕсли;
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаВызовов(), УровеньЖурналаРегистрации.Информация, , , Комментарий);

КонецПроцедуры

// Имя HTTP-заголовка, в котором оркестратор передает токен пользователя.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяЗаголовкаТокена() Экспорт

	Возврат "X-MCP-Token";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает новый токен и возвращает его. В регистре остается только хеш SHA-256.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - владелец токена
//  Вид          - Строка - см. ВидТокенаЗапроса, ВидТокенаПерсональный
//  СрокДействия - Дата
//  Описание     - Строка
//
// Возвращаемое значение:
//  Строка - токен
//
Функция НовыйТокен(Пользователь, Вид, СрокДействия, Описание)

	Токен = "mcpt_" + mcp_НастройкиLLM.НовыйКлюч();

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		МенеджерЗаписи = РегистрыСведений.mcp_ТокеныДоступа.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ХешТокена       = ХешТокена(Токен);
		МенеджерЗаписи.Пользователь    = Строка(Пользователь.УникальныйИдентификатор());
		МенеджерЗаписи.ИмяПользователя = Строка(Пользователь);
		МенеджерЗаписи.Вид             = Вид;
		МенеджерЗаписи.СрокДействия    = СрокДействия;
		МенеджерЗаписи.Создан          = ТекущаяДатаСеанса();
		МенеджерЗаписи.Описание        = Лев(Описание, ДлинаОписанияТокена());
		МенеджерЗаписи.Записать(Истина);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Токен;

КонецФункции

// Сведения о токене по хешу.
//
// Параметры:
//  Хеш - Строка - SHA-256 токена
//
// Возвращаемое значение:
//  Структура, Неопределено - поля Пользователь, ИмяПользователя, Вид, СрокДействия; Неопределено, если токена нет
//
Функция СведенияТокена(Хеш)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		МенеджерЗаписи = РегистрыСведений.mcp_ТокеныДоступа.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ХешТокена = Хеш;
		МенеджерЗаписи.Прочитать();
		Сведения = Неопределено;
		Если МенеджерЗаписи.Выбран() Тогда
			Сведения = Новый Структура("Пользователь, ИмяПользователя, Вид, СрокДействия");
			ЗаполнитьЗначенияСвойств(Сведения, МенеджерЗаписи);
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Сведения;

КонецФункции

// Удаляет токен по хешу.
//
// Параметры:
//  Хеш - Строка - SHA-256 токена
//
Процедура УдалитьТокен(Хеш)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НаборЗаписей = РегистрыСведений.mcp_ТокеныДоступа.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ХешТокена.Установить(Хеш);
		НаборЗаписей.Записать(Истина);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Удаляет токены с истекшим сроком действия.
Процедура УдалитьПросроченныеТокены()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Токены.ХешТокена КАК ХешТокена
	|ИЗ
	|	РегистрСведений.mcp_ТокеныДоступа КАК Токены
	|ГДЕ
	|	Токены.СрокДействия < &ТекущаяДата";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Пока Выборка.Следующий() Цикл
		УдалитьТокен(Выборка.ХешТокена);
	КонецЦикла;

КонецПроцедуры

// Пользователь ИБ по UUID элемента справочника Пользователи. Неопределено, если элемент не найден,
// помечен на удаление, недействителен или не связан с пользователем ИБ.
//
// Параметры:
//  ИдентификаторПользователя - Строка - UUID элемента справочника Пользователи
//
// Возвращаемое значение:
//  ПользовательИнформационнойБазы, Неопределено
//
Функция ПользовательИБПоИдентификаторуПользователя(ИдентификаторПользователя)

	Ссылка = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПользователя));

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"Ссылка, ПометкаУдаления, Недействителен, ИдентификаторПользователяИБ");
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Если Не ЗначениеЗаполнено(Реквизиты.Ссылка) Или Реквизиты.ПометкаУдаления Или Реквизиты.Недействителен Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат НайтиПользователяИБ(Строка(Реквизиты.ИдентификаторПользователяИБ));

КонецФункции

// Пользователь ИБ по его UUID.
//
// Параметры:
//  ИдентификаторПользователяИБ - Строка - UUID пользователя ИБ
//
// Возвращаемое значение:
//  ПользовательИнформационнойБазы, Неопределено
//
Функция НайтиПользователяИБ(ИдентификаторПользователяИБ)

	Если Не ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		Возврат Неопределено;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			Новый УникальныйИдентификатор(ИдентификаторПользователяИБ));
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ПользовательИБ;

КонецФункции

// Право пользователя ИБ на объект метаданных. Проверка прав другого пользователя требует
// привилегированного режима. Объекты, к которым права не применяются (подсистемы, общие модули,
// перечисления), считаются доступными.
//
// Параметры:
//  Право            - Строка - имя права
//  ОбъектМетаданных - ОбъектМетаданных
//  ПользовательИБ   - ПользовательИнформационнойБазы
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьПраво(Право, ОбъектМетаданных, ПользовательИБ)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ПравоДоступа(Право, ОбъектМетаданных, ПользовательИБ);
	Исключение
		// Право не применяется к объектам этого вида: ограничивать по нему нечего
		Результат = Истина;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// SHA-256 токена шестнадцатеричной строкой.
//
// Параметры:
//  Токен - Строка
//
// Возвращаемое значение:
//  Строка - 64 символа
//
Функция ХешТокена(Токен)

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(Токен);
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));

КонецФункции

// Значение заголовка без учета регистра имени: прокси-серверы меняют регистр заголовков.
//
// Параметры:
//  Заголовки - Соответствие - заголовки HTTP-запроса
//  Имя       - Строка - имя заголовка
//
// Возвращаемое значение:
//  Строка - значение заголовка или пустая строка
//
Функция ЗначениеЗаголовка(Заголовки, Имя)

	ИмяНРег = НРег(Имя);
	Для Каждого КлючЗначение Из Заголовки Цикл
		Если НРег(КлючЗначение.Ключ) = ИмяНРег Тогда
			Возврат СокрЛП(КлючЗначение.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Вызывает исключение, если у текущего пользователя нет полных прав.
Процедура ПроверитьПравоАдминистрирования()

	Если Не mcp_НастройкиLLM.ЭтоАдминистратор() Тогда
		ВызватьИсключение "Управлять токенами может только пользователь с полными правами";
	КонецЕсли;

КонецПроцедуры

// Длина реквизита Описание регистра mcp_ТокеныДоступа.
//
// Возвращаемое значение:
//  Число
//
Функция ДлинаОписанияТокена()
	
	Возврат Метаданные.РегистрыСведений.mcp_ТокеныДоступа.Ресурсы.Описание.Тип.КвалификаторыСтроки.Длина;
	
КонецФункции

// Вид токена одного вопроса.
//
// Возвращаемое значение:
//  Строка
//
Функция ВидТокенаЗапроса()

	Возврат "Запрос";

КонецФункции

// Вид персонального токена внешнего MCP-клиента.
//
// Возвращаемое значение:
//  Строка
//
Функция ВидТокенаПерсональный()

	Возврат "Персональный";

КонецФункции

// Событие журнала регистрации для выпуска и отзыва токенов.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяСобытияЖурнала()

	Возврат "MCP.ТокеныДоступа";

КонецФункции

// Событие журнала регистрации для вызовов инструментов.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяСобытияЖурналаВызовов()

	Возврат "MCP.ВызовИнструмента";

КонецФункции

#КонецОбласти
